#include <stdio.h>
//Вивести вік людини (від 1 до 150 років) і вивсти його із наступним відповідним словом "рік", "роки", "років".
int main(){
    int y;
    do{
        printf("Введіть свій вік: ");
        scanf("%d", &y);
    } while(y < 1 || y > 150);
    if(y == 1 || (y % 10 == 1 && y != 11)){
        printf("Вам %d рік", y);    
    }
    else if((y % 10 == 2 || y % 10 == 3 || y % 10 == 4) && y != 12 && y != 13 && y != 14 ){
        printf("Вам %d роки", y);
    }else{
        printf("Вам %d років", y);
    }
    
}
